app/controllers/journey_controller.rb

SELECT `journeys`.* FROM `journeys`
---
    def index
      journeys = Journey.all

SELECT `user_journeys`.* FROM `user_journeys` WHERE `user_journeys`.`journey_id` = 1
---
    def show
      journey = Journey.find(params[:id])

INSERT INTO `journeys` (`journey_name`, `display_name`, `overview_message`, `complete_message`, `journey_status`, `created_at`, `updated_at`) VALUES ('', '', '', '', NULL, '2023-02-23 10:10:56.762496', '2023-02-23 10:10:56.762496')
INSERT INTO `stages` (`stage_name`, `overview_message`, `comletion_message`, `created_at`, `updated_at`, `journey_id`) VALUES ('onestage14', 's1overview', 's1complete', '2023-03-03 10:40:42.664118', '2023-03-03 10:40:42.664118', 4)
---
    def create
      journey = Journey.new(journey_params)
      if journey.save
        stages_params.each do |stage_params|
          stage = journey.stages.new(stage_params.slice(:stage_name, :overview_message, :comletion_message))
          if stage.save

INSERT INTO `stages` (`stage_name`, `overview_message`, `comletion_message`, `created_at`, `updated_at`, `journey_id`) VALUES ('sname2', '2soverview', NULL, '2023-03-03 10:02:37.597704', '2023-03-03 10:02:37.597704', 25)
INSERT INTO `activities` (`name`, `activity_type`, `created_at`, `updated_at`) VALUES ('video', 'Link', '2023-03-13 08:34:08.094138', '2023-03-13 08:34:08.094138')
---
    def create_activities(stage, activities_params)
      activities_params.each do |activity_params|
        activity = stage.activities.new(activity_params.permit(:name, :activity_type).merge(stage_id: stage.id))
        unless activity.save