app/controllers/organization_controller.rb

    def create
         @organization = Organization.new(params_organization)
         if @organization.save
---
INSERT INTO `organizations` (`organization_name`, `created_at`, `updated_at`) VALUES ('Cerner-NorthGate', '2023-02-17 05:54:42.906054', '2023-02-17 05:54:42.906054')