app/controllers/session_controller.rb

def create
    @user = User.find_by(email: params_user[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'ramya@gmail.com' LIMIT 1