app/controllers/user_controller.rb

    def create
         @user = User.create(params_user)
---
INSERT INTO `users` (`fname`, `lname`, `email`, `password_digest`, `user_status`, `organization_id`, `created_at`, `updated_at`, `useraccess`) VALUES ('tarak', 'ram', 'tarak@gmail.com', '$2a$12$9WlTBbG6RY8sRfsT0pEaoeCC/KULKsXaugOnFy4EJPxw4WdHOrBI2', NULL, 2, '2023-03-02 05:04:11.453797', '2023-03-02 05:04:11.453797', NULL)

    def login
         @user = User.find_by( email: params_user[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'sree@gmail.com' LIMIT 1